scripts/jmeter/testTrack-500.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="OnboardingTest">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Users">
        <intProp name="ThreadGroup.num_threads">500</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/page</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1310812339">[{&quot;id&quot;:2,&quot;content&quot;:&quot;&lt;html&gt;&quot;,&quot;name&quot;:&quot;top page&quot;,&quot;orderInModule&quot;:1,&quot;moduleId&quot;:3},{&quot;id&quot;:3,&quot;content&quot;:&quot;&lt;html&gt;&quot;,&quot;name&quot;:&quot;top page&quot;,&quot;orderInModule&quot;:1,&quot;moduleId&quot;:3},{&quot;id&quot;:4,&quot;content&quot;:&quot;&lt;html&gt; updated&quot;,&quot;name&quot;:&quot;top page updated&quot;,&quot;orderInModule&quot;:1,&quot;moduleId&quot;:1},{&quot;id&quot;:5,&quot;content&quot;:&quot;&lt;html&gt; updated&quot;,&quot;name&quot;:&quot;top page updated&quot;,&quot;orderInModule&quot;:1,&quot;moduleId&quot;:1}] ZALUPA</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
          <JSONPathAssertion guiclass="JSONPathAssertionGui" testclass="JSONPathAssertion" testname="JSON Assertion" enabled="false">
            <stringProp name="JSON_PATH">[{&quot;id&quot;:2,&quot;content&quot;:&quot;&lt;html&gt;&quot;,&quot;name&quot;:&quot;top page&quot;,&quot;orderInModule&quot;:1,&quot;moduleId&quot;:3},{&quot;id&quot;:3,&quot;content&quot;:&quot;&lt;html&gt;&quot;,&quot;name&quot;:&quot;top page&quot;,&quot;orderInModule&quot;:1,&quot;moduleId&quot;:3},{&quot;id&quot;:4,&quot;content&quot;:&quot;&lt;html&gt; updated&quot;,&quot;name&quot;:&quot;top page updated&quot;,&quot;orderInModule&quot;:1,&quot;moduleId&quot;:1},{&quot;id&quot;:5,&quot;content&quot;:&quot;&lt;html&gt; updated&quot;,&quot;name&quot;:&quot;top page updated&quot;,&quot;orderInModule&quot;:1,&quot;moduleId&quot;:1}]</stringProp>
            <stringProp name="EXPECTED_VALUE">{&quot;id&quot;:2,&quot;content&quot;:&quot;&lt;html&gt;&quot;,&quot;name&quot;:&quot;top page&quot;,&quot;orderInModule&quot;:1,&quot;moduleId&quot;:3},{&quot;id&quot;:3,&quot;content&quot;:&quot;&lt;html&gt;&quot;,&quot;name&quot;:&quot;top page&quot;,&quot;orderInModule&quot;:1,&quot;moduleId&quot;:3},{&quot;id&quot;:4,&quot;content&quot;:&quot;&lt;html&gt; updated&quot;,&quot;name&quot;:&quot;top page updated&quot;,&quot;orderInModule&quot;:1,&quot;moduleId&quot;:1},{&quot;id&quot;:5,&quot;content&quot;:&quot;&lt;html&gt; updated&quot;,&quot;name&quot;:&quot;top page updated&quot;,&quot;orderInModule&quot;:1,&quot;moduleId&quot;:1}</stringProp>
            <boolProp name="JSONVALIDATION">false</boolProp>
            <boolProp name="EXPECT_NULL">false</boolProp>
            <boolProp name="INVERT">false</boolProp>
            <boolProp name="ISREGEX">false</boolProp>
          </JSONPathAssertion>
          <hashTree/>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer eyJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ0ZXN0QG1haWwucnUiLCJpYXQiOjE3NDgwMDQ2NDYsImV4cCI6MTc0ODAwNjA4Nn0.Ck3qNXsXRukgQHzxjaM2LPc2MO1T8l7wDAU26XINIK4</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>